WITH ingredient_names AS (
    SELECT unnest(ARRAY[
        'Помидор', 'Огурец', 'Картофель', 'Лук', 'Морковь', 'Курица', 'Говядина', 
        'Свинина', 'Лосось', 'Тунец', 'Молоко', 'Сыр', 'Яйца', 'Мука', 'Сахар', 
        'Соль', 'Перец', 'Масло оливковое', 'Чеснок', 'Зелень', 'Сливки', 'Масло сливочное',
        'Йогурт', 'Творог', 'Сметана', 'Кефир', 'Рис', 'Гречка', 'Макароны', 'Хлеб',
        'Баклажан', 'Кабачок', 'Тыква', 'Капуста', 'Брокколи', 'Цветная капуста',
        'Фасоль', 'Горох', 'Кукуруза', 'Грибы', 'Креветки', 'Кальмары', 'Мидии',
        'Апельсин', 'Лимон', 'Яблоко', 'Груша', 'Банан', 'Клубника', 'Малина'
    ]) AS name
)
INSERT INTO "Ingredients"  ("Id" , "Name" , "Description" , "Comment" , "IsDeleted" )
SELECT     
	gen_random_uuid(),
	(select * from ingredient_names offset ser % 50 limit 1) || ' ' || ser,    
    'Описание ингредиента ' || (select * from ingredient_names offset ser % 50 limit 1) || ' для использования в различных блюдах',
    'Хранить в прохладном месте, срок годности - ' || (random() * 30 + 1)::int || ' дней',
    CASE WHEN random() < 0.05
    	THEN true 
    	ELSE false 
    END as IsDeleted
FROM generate_series(1, 500) AS ser